
## Plan Result (feature-flags-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/59018)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 0 to change, 2 to destroy.</code></pre>

* Replace
  * aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4
  * local_file.application_ecs_service_appspec_94386B9C


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4 must be replaced
-/+ resource "aws_ecs_task_definition" "application_ecs_service_ecs-task_461CC9D4" {
      ~ arn                      = "arn:aws:ecs:us-east-1:996905175585:task-definition/FeatureFlags-Prod:352" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:996905175585:task-definition/FeatureFlags-Prod" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ image                  = "996905175585.dkr.ecr.us-east-1.amazonaws.com/featureflags-prod-app:4bccfbb7058f50f9de78a8b1e5cc69cfa491f4eb" -> "996905175585.dkr.ecr.us-east-1.amazonaws.com/featureflags-prod-app:1194e79b5ecf4d60ce0ca72bdcbf921298ea91df"
                    name                   = "app"
                  ~ portMappings           = [
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                    ]
                    # (9 unchanged attributes hidden)
                },
                {
                    command                = [
                        "--region",
                        "us-east-1",
                        "--local-mode",
                    ]
                    cpu                    = 0
                    environment            = []
                    essential              = true
                    image                  = "amazon/aws-xray-daemon"
                    logConfiguration       = {
                        logDriver     = "awslogs"
                        options       = {
                            awslogs-group         = "/ecs/FeatureFlags-Prod/xray-daemon20231129182155361100000003"
                            awslogs-region        = "us-east-1"
                            awslogs-stream-prefix = "ecs"
                        }
                        secretOptions = []
                    }
                    mountPoints            = []
                    name                   = "xray-daemon"
                    portMappings           = [
                        {
                            containerPort = 2000
                            hostPort      = 2000
                            protocol      = "udp"
                        },
                    ]
                    readonlyRootFilesystem = false
                    repositoryCredentials  = {
                        credentialsParameter = "arn:aws:secretsmanager:us-east-1:996905175585:secret:Shared/DockerHub"
                    }
                    volumesFrom            = []
                },
            ] # forces replacement
        )
      ~ id                       = "FeatureFlags-Prod" -> (known after apply)
      ~ revision                 = 352 -> (known after apply)
        tags                     = {
            "environment" = "Prod"
            "service"     = "FeatureFlags"
        }
        # (10 unchanged attributes hidden)
    }

  # local_file.application_ecs_service_appspec_94386B9C must be replaced
-/+ resource "local_file" "application_ecs_service_appspec_94386B9C" {
      ~ content              = jsonencode(
            {
              - Resources = [
                  - {
                      - TargetService = {
                          - Properties = {
                              - LoadBalancerInfo = {
                                  - ContainerName = "app"
                                  - ContainerPort = 4242
                                }
                              - TaskDefinition   = "arn:aws:ecs:us-east-1:996905175585:task-definition/FeatureFlags-Prod:352"
                            }
                          - Type       = "AWS::ECS::Service"
                        }
                    },
                ]
              - version   = 1
            } # forces replacement
        ) -> (known after apply) # forces replacement
      ~ content_base64sha256 = "yIFJV4CRq33aZd+Aqlya6mUoPMVQ2PYOcX8HYIBERM0=" -> (known after apply)
      ~ content_base64sha512 = "+nOISAcuHfc0xxfIjxuNeyXa9hWEzKfwFuae+yTSYY+L+hpEiIJkHu0eZBaeu884sj1QaHfLUpZKUpZRVHNipg==" -> (known after apply)
      ~ content_md5          = "a359d5fdeac3b29b20cac4becdf63de2" -> (known after apply)
      ~ content_sha1         = "01cae3323458702f8472da838eaa753f40763a90" -> (known after apply)
      ~ content_sha256       = "c88149578091ab7dda65df80aa5c9aea65283cc550d8f60e717f0760804444cd" -> (known after apply)
      ~ content_sha512       = "fa738848072e1df734c717c88f1b8d7b25daf61584cca7f016e69efb24d2618f8bfa1a448882641eed1e64169ebbcf38b23d506877cb52964a529651547362a6" -> (known after apply)
      ~ id                   = "01cae3323458702f8472da838eaa753f40763a90" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobID":"146f8b3e-acd6-48b4-b826-8a809c76500f","JobName":"feature-flags_infrastructure_plan_prod","PRNumber":210,"Program":"tfcmt","SHA1":"1194e79b5ecf4d60ce0ca72bdcbf921298ea91df","Target":"feature-flags-cdk","Vars":{}} -->